# SourceDocument Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TransferringProjectStandardsEventArgs..::..SourceDocument Property
TransferringProjectStandardsEventArgs Class See Also
---
Source document.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017.2
# Syntax
C#
---
```text
public Document SourceDocument { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SourceDocument As Document
	Get
```

Visual C++
---
```text
public:
property Document^ SourceDocument {
	Document^ get ();
}
```

# See Also
TransferringProjectStandardsEventArgs Class
Autodesk.Revit.UI.Events Namespace